In [3]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

##### Prepare SQL connection

In [5]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

'Connected: root@bank'

### JOINS

See ppt slides in the reference_slides folder

In [7]:
%%sql
select count(distinct account_id) from bank.account;

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[(4499,)]

In [8]:
%%sql
select count(distinct account_id) from bank.loan;

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[(683,)]

Not all accounts have a loan from the bank!
There are multiple ways to join these tables...

##### Left join

In [11]:
%%sql
select a.account_id, a.frequency, l.loan_id, l.amount, l.duration, l.payments, l.status
from bank.account a
left join bank.loan l on a.account_id = l.account_id
order by a.account_id
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(1, 'POPLATEK MESICNE', None, None, None, None, None),
 (2, 'POPLATEK MESICNE', 4959, 80952, 24, 3373.0, 'A'),
 (3, 'POPLATEK MESICNE', None, None, None, None, None),
 (4, 'POPLATEK MESICNE', None, None, None, None, None),
 (5, 'POPLATEK MESICNE', None, None, None, None, None),
 (6, 'POPLATEK MESICNE', None, None, None, None, None),
 (7, 'POPLATEK MESICNE', None, None, None, None, None),
 (8, 'POPLATEK MESICNE', None, None, None, None, None),
 (9, 'POPLATEK MESICNE', None, None, None, None, None),
 (10, 'POPLATEK MESICNE', None, None, None, None, None)]

##### Right join

In [13]:
%%sql
select a.account_id, a.frequency, l.loan_id, l.amount, l.duration, l.payments, l.status
from bank.account a
right join bank.loan l on a.account_id = l.account_id
order by a.account_id
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(None, None, 8000, 96396, 12, 8033.0, 'C'),
 (None, None, 8000, 96396, 12, 8033.0, 'C'),
 (None, None, 8000, 96396, 12, 8033.0, 'C'),
 (2, 'POPLATEK MESICNE', 4959, 80952, 24, 3373.0, 'A'),
 (19, 'POPLATEK MESICNE', 4961, 30276, 12, 2523.0, 'B'),
 (25, 'POPLATEK MESICNE', 4962, 30276, 12, 2523.0, 'A'),
 (37, 'POPLATEK MESICNE', 4967, 318480, 60, 5308.0, 'D'),
 (38, 'POPLATEK TYDNE', 4968, 110736, 48, 2307.0, 'C'),
 (67, 'POPLATEK MESICNE', 4973, 165960, 24, 6915.0, 'A'),
 (97, 'POPLATEK MESICNE', 4986, 102876, 12, 8573.0, 'A')]

##### Can we do the same with Pandas ?

In [17]:
df_account = %sql select account_id, frequency from bank.account;
df_account = df_account.DataFrame()

 * mysql+pymysql://root:***@localhost/bank
4499 rows affected.

In [22]:
df_loan = %sql select account_id, loan_id, amount, duration, payments, status from bank.loan;
df_loan = df_loan.DataFrame()

 * mysql+pymysql://root:***@localhost/bank
685 rows affected.

In [24]:
df_join = pd.merge(df_account, df_loan, on = 'account_id', how='left')

In [27]:
df_join.head(5)

   account_id         frequency  loan_id   amount  duration  payments status
0           1  POPLATEK MESICNE      NaN      NaN       NaN       NaN    NaN
1           2  POPLATEK MESICNE   4959.0  80952.0      24.0    3373.0      A
2           3  POPLATEK MESICNE      NaN      NaN       NaN       NaN    NaN
3           4  POPLATEK MESICNE      NaN      NaN       NaN       NaN    NaN
4           5  POPLATEK MESICNE      NaN      NaN       NaN       NaN    NaN